package Web3jNetty.datebirth.utilClass;
/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

import Web3jNetty.datebirth.util.LuozhuangNameClass;
import Web3jNetty.datebirth.util.Luozhuangnamewuxing;

/**
 * 名字测试
 *
 * @author luozhuang 大师♂罗莊
 */
public class JavaLuozhuangtestnameClass {

    String[][] arraytotal = {
            {"1", "（太极之数）太极之数，万物开泰，生发无穷，利禄亨通。", "（吉）"},
            {"2", "（两仪之数）两仪之数，混沌未开，进退保守，志望难达。", "（凶）"},
            {"3", "（三才之数）三才之数，天地人和，大事大业，繁荣昌隆。", "（吉）"},
            {"4", "（四象之数）四象之数，待于生发，万事慎重，不具营谋。", "（凶）"},
            {"5", "（五行之数）五行俱权，循环相生，圆通畅达，福祉无穷。", "（吉）"},
            {"6", "（六爻之数）六爻之数，发展变化，天赋美德，吉祥安泰。", "（吉）"},
            {"7", "（七政之数）七政之数，精悍严谨，天赋之力，吉星照耀。", "（吉）"},
            {"8", "（八卦之数）八卦之数，乾坎艮震，巽离坤兑，无穷无尽。(半吉)"},
            {"9", "（大成之数）大成之数，蕴涵凶险，或成或败，难以把握。", "（凶）"},
            {"10", "(终结之数）终结之数，雪暗飘零，偶或有成，回顾茫然。", "（凶）"},
            {"11", "（旱苗逢雨）万物更新，调顺发达，恢弘泽世，繁荣富贵。", "（吉）"},
            {"12", "（掘井无泉）无理之数，发展薄弱，虽生不足，难酬志向。", "（凶）"},
            {"13", "（春日牡丹）才艺多能，智谋奇略，忍柔当事，鸣奏大功。", "（吉）"},
            {"14", "（破兆）家庭缘薄，孤独遭难，谋事不达，悲惨不测。", "（凶）"},
            {"15", "（福寿）福寿圆满，富贵荣誉，涵养雅量，德高望重。", "（吉）"},
            {"16", "（厚重）厚重载德，安富尊荣，财官双美，功成名就。", "（吉）"},
            {"17", "（刚强）权威刚强，突破万难，如能容忍，必获成功。", "（半吉）"},
            {"18", "（铁镜重磨）权威显达，博得名利，且养柔德，功成名就。", "（半吉）"},
            {"19", "（多难）风云蔽日，辛苦重来，虽有智谋，万事挫折。", "（凶）"},
            {"20", "（屋下藏金）非业破运，灾难重重，进退维谷，万事难成。", "（凶）"},
            {"21", "（明月中天）光风霁月，万物确立，官运亨通，大搏名利。女性不宜此数。（吉）"},
            {"22", "（秋草逢霜）秋草逢霜，困难疾弱，虽出豪杰，人生波折。", "（凶）"},
            {"23", "（壮丽）旭日东升，壮丽壮观，权威旺盛，功名荣达。女性不宜此数。（吉）"},
            {"24", "（掘藏得金）家门余庆，金钱丰盈，白手成家，财源广进。", "（吉）"},
            {"25", "（荣俊）资性英敏，才能奇特，克服傲慢，尚可成功。", "（半吉）"},
            {"26", "（变怪）变怪之谜，英雄豪杰，波澜重叠，而奏大功。", "（凶）"},
            {"27", "（增长）欲望无止，自我强烈，多受毁谤，尚可成功。", "（半吉）"},
            {"28", "（阔水浮萍）遭难之数，豪杰气概，四海漂泊，终世浮躁。女性不宜此数。", "（凶）"},
            {"29", "（智谋）智谋优秀，财力归集，名闻海内，成就大业。", "（吉）"},
            {"30", "（非运）沉浮不定，凶吉难变，若明若暗，大成大败。", "（半吉）"},
            {"31", "（春日花开）智勇得志，博得名利，统领众人，繁荣富贵。", "（吉）"},
            {"32", "（宝马金鞍）侥幸多望，贵人得助，财帛如裕，繁荣至上。", "（吉）"},
            {"33", "（旭日升天）旭日升天，鸾凤相会，名闻天下，隆昌至极。女性不宜此数。", "（吉）"},
            {"34", "（破家）破家之身，见识短小，辛苦遭逢，灾祸至极。", "（凶）"},
            {"35", "（高楼望月）温和平静，智达通畅，文昌技艺，奏功洋洋。", "（吉）"},
            {"36", "（波澜重叠）波澜重叠，沉浮万状，侠肝义胆，舍己成仁。", "（半吉）"},
            {"37", "（猛虎出林）权威显达，热诚忠信，宜着雅量，终身荣富。", "（吉）"},
            {"38", "（磨铁成针）意志薄弱，刻意经营，才识不凡，技艺有成。", "（半吉）"},
            {"39", "（富贵荣华）富贵荣华，财帛丰盈，暗藏险象，德泽四方。", "（半吉）"},
            {"40", "（退安）智谋胆力，冒险投机，沉浮不定，退保平安。", "（半吉） "},
            {"41", "（有德）纯阳独秀，德高望重，和顺畅达，博得名利。此数为最大好运数。", "（吉）"},
            {"42", "（寒蝉在柳）博识多能，精通世情，如能专心，尚可成功。", "（半吉）"},
            {"43", "（散财破产）散财破产，诸事不遂，虽有智谋，财来财去。", "（凶）"},
            {"44", "（烦闷）破家亡身，暗藏惨淡，事不如意，乱世怪杰。", "（凶）"},
            {"45", "（顺风）新生泰和，顺风扬帆，智谋经纬，富贵繁荣。", "（吉）"},
            {"46", "（浪里淘金）载宝沉舟，浪里淘金，大难尝尽，大功有成。", "（半吉）"},
            {"47", "（点石成金）花开之象，万事如意，祯祥吉庆，天赋幸福。", "（吉）"},
            {"48", "（古松立鹤）智谋兼备，德量荣达，威望成师，洋洋大观。", "（吉）"},
            {"49", "（转变）吉临则吉，凶来则凶，转凶为吉，配好三才。", "（半吉）"},
            {"50", "（小舟入海）一成一败，吉凶参半，先得庇荫，后遭凄惨。", "（半吉）"},
            {"51", "（沉浮）盛衰交加，波澜重叠，如能慎始，必获成功。", "（半吉）"},
            {"52", "（达眼）卓识达眼，先见之明，智谋超群，名利双收。", "（吉）"},
            {"53", "（曲卷难星）外祥内患，外祸内安，先富后贫，先贫后富。", "（凶）"},
            {"54", "（石上栽花）石上栽花，难得有活，忧闷烦来，辛惨不绝。", "（凶）"},
            {"55", "（善恶）善善得恶，恶恶得善，吉到极限，反生凶险。", "（半吉）"},
            {"56", "（浪里行舟）历尽艰辛，四周障碍，万事龃龌，做事难成。", "（凶）"},
            {"57", "（日照春松）寒雪青松，夜莺吟春，必遭一过，繁荣白事。", "（吉）"},
            {"58", "（晚行遇月）沉浮多端，先苦后甜，宽宏扬名，富贵繁荣。", "（半吉）"},
            {"59", "（寒蝉悲风）寒蝉悲风，意志衰退，缺乏忍耐，苦难不休。", "（凶）"},
            {"60", "（无谋）无谋之人，漂泊不定，晦暝暗黑，动摇不安。", "（凶）"},
            {"61", "（牡丹芙蓉）牡丹芙蓉，花开富贵，名利双收，定享天赋。", "（吉）"},
            {"62", "（衰败）衰败之象，内外不和，志望难达，灾祸频来。", "（凶）"},
            {"63", "（舟归平海）富贵荣华，身心安泰，雨露惠泽，万事亨通。", "（吉）"},
            {"64", "（非命）骨肉分离，孤独悲愁，难得心安，做事不成。", "（凶）"},
            {"65", "（巨流归海）天长地久，家运隆昌，福寿绵长，事事成就。", "（吉）"},
            {"66", "（岩头步马）进退维谷，艰难不堪，等待时机，一跃而起。", "（凶）"},
            {"67", "（顺风通达）天赋幸运，四通八达，家道繁昌，富贵东来。", "（吉）"},
            {"68", "（顺风吹帆）智虑周密，集众信达，发明能智，拓展昂进。", "（吉）"},
            {"69", "（非业）非业非力，精神迫滞，灾害交至，遍偿痛苦。", "（凶）"},
            {"70", "（残菊逢霜）残菊逢霜，寂寞无碍，惨淡忧愁，晚景凄凉。", "（凶）"},
            {"71", "（石上金花）石上金花，内心劳苦，贯彻始终，定可昌隆。", "（半吉）"},
            {"72", "（劳苦）荣苦相伴，阴云覆月，外表吉祥，内实凶祸。", "（半吉）"},
            {"73", "（无勇）盛衰交加，徒有高志，天王福祉，终世平安。", "（半吉）"},
            {"74", "（残菊经霜）残菊经霜，秋叶寂寞，无能无智，辛苦繁多。", "（凶）"},
            {"75", "（退守）退守保吉，发迹甚迟，虽有吉象，无谋难成。", "（凶）"},
            {"76", "（离散）倾覆离散，骨肉分离，内外不和，虽劳无功。", "（凶）"},
            {"77", "（半吉）家庭有悦，半吉半凶，能获援护，陷落不幸。", "（半吉）"},
            {"78", "（晚苦）祸福参半，先天智能，中年发达，晚景困苦。", "（凶）"},
            {"79", "（云头望月）云头望月，身疲力尽，穷迫不伸，精神不定。", "（凶）"},
            {"80", "（遁吉）辛苦不绝，早入隐遁，安心立命，化凶转吉。", "（凶）"},
            {"81", "（万物回春）最吉之数，还本归元，吉祥重叠，富贵尊荣。", "（吉）"}};
    String[][] arrayTDRG = {
            {"木木木", "吉", "★基礎安定，成功順調，希望到成，能向上發展，所求之事頗能如願；家業興隆，身心健全，保養得宜，能得長壽。若數理有凶，須防仇害之慮。"},
            {"木木火", "吉", "★天賦機智而靈敏，成功順調，少有障礙而向上發展，基礎運勢安泰；頗得人緣，受人之助而順調成功，能享受幸福、繁榮，一生有福壽。"},
            {"木木土", "吉", "★性情穩健，境遇堅固，幸福長壽；然，與人相處要培養寬恕之道。辛勤創業，一生可以吉順，尤其中年之後能夠一展才學；家庭美滿，妻賢子孝，晚年聚財。健康注意腸胃、肝疾。"},
            {"木木金", "凶", "★有轉動，難得平安，一生比較勞苦，精神壓力大；為人正直，比較缺乏耐性，有時候情緒很難掌控，因此夫妻之間爭吵多見。健康注意呼吸系統、肺功能、泌尿、精神壓力，並防腦神經或肺部氣管方面的病疾。"},
            {"木木水", "凶", "★為人意志堅定，一生辛勞勤奮，雖然財運平常，倒能夠守成度日；雖有一時成功順利發展的機會，容易因不節制而招致失敗。夫妻感情難言和偕。由於憂悶或病弱之故，罹患耳、腎、骨等病疾。"},
            {"木火木", "吉", "★能得到上下的幫助而得發展、幸福、長壽。待人誠懇，做事積極，三十五歲後有成就，最好穩定中求發展；個性達觀積極，能展抱負，晚年幸福，夫妻和偕、子女賢孝有相當成就，是完美的格局。"},
            {"木火火", "吉", "★人緣很好，特別有異性緣，一生財錢無缺、而且貴人多助，是富裕的格局；夫妻相處合樂、子女可以賢孝。早年自信心過強，缺乏忍耐力，為人衝動而積極，可以一展才華，得到相當的成就；但由於耐心不夠，恐怕終致失敗。此格火氣旺盛，若能凡事要三思而行，則更能增加成功機會。晚年注意心臟、高血壓病。"},
            {"木火土", "吉", "★一生多能受到長輩的賞識提拔而發展成功。主觀而熱情，有責任心，對下親切，事業有成就、財運豐厚，有人緣；夫妻可望圓滿幸福，子女能出人頭地。此乃長壽幸福之格，晚年吉祥如意；健康注意肝臟、高血壓病。"},
            {"木火金", "凶", "★為人坦誠直率，做事衝動而積極，能得朋友相助，花錢較浪費；事業不振，身心過勞，雖然能夠得到一時的成功，但防因為基礎不穩固而致不幸。家庭運差，夫妻常見爭吵不悅，個性有不和現象。健康注意腦神經衰弱、呼吸系統、肢體災疾、皮膚病。"},
            {"木火水", "凶", "★能言善道，急性不服輸，爭強好勝，易得罪人，乃畢生最大缺失；或有一時之成就，只恐曇花一現，好景不長，做事最好三思退守。夫妻一般感情不好，常有不悅事生；晚年財運不穩，心神比較不安寧。健康注意外傷、心、腎之災。"},
            {"木土木", "凶", "★運途不佳，性情孤獨，雖有理想大志，很難如願。待人處事很熱心，意志力卻很不堅定，目標變化大，造成容易失去許多好機會；縱有努力，財錢收穫不多，一生比較勞心勞力，最好步步為營，才是良策。夫妻常為小事爭吵。健康注意腸胃、肝疾。"},
            {"木土火	小	吉	★為人表面達觀，內心實多憂苦，有人緣，能成功發展。有堅強意志力，能夠辛勤努力以赴，財錢還算小有積蓄。夫妻時有爭吵，感情大致圓滿。晚年健康注意腸胃、皮膚病、精神難得安寧。	"},
            {"木土土	小	吉	★待人誠懇，表現樂觀，其實是一個內心多存苦憂之人。一生辛勤勞力，財錢收益不多。做事缺乏果斷力，很容易衝動，難以掌握目標。夫妻時有相爭，家內不太合睦。切勿爭強好勝，其實平安才是真正的幸福。健康注意腸胃、筋骨、肝疾。	"},
            {"木土金", "吉", "★常為家庭而辛勤奮力，是一個能負責任的人。行為處事謙恭有禮，人緣很好，工作能力也強，可惜耐心不足、眼高手低。雖有展穫，四十歲前只能小見成就；若要發展，除去前述缺失，中年而後，定能事業如意，名利兼得。夫妻大致和樂，要防桃花情遇事生。健康注意腸胃、外傷。"},
            {"木土水", "凶", "★人緣不錯，要領欠佳，事職過程比較辛苦，諸事很難如意，心情苦惱事多；必須自力更生，貴人少助，作事總是勞碌，財錢收穫不多，一生財運難旺，只能勤儉行事。夫妻相處不和，家運有欠平安。健康注意腸胃、肝、腎之疾。"},
            {"木金木", "凶", "★做事雖然勤奮，主觀太強，意志也不很堅定，乃造成見有食無現象，表面風光，其實內心憂鬱、很難一展才能；財運很差，終生勞苦少成少得，晚年有難以預測的災厄。夫妻感情難偕，家運方面，亦多見不幸情形只怕中途孤雁紛飛。健康注意腦神經、筋骨肢體、肺、外傷事故。"},
            {"木金火", "凶", "★基礎不穩，成功運亦不佳。內心多有熬煎，容易罹患神經衰弱及呼吸器官的病疾。"},
            {"木金土", "凶", "★如果加倍努力，亦可得成功。此格者，容易身心過勞而遭遇不幸的病難，多有肝病、胃病。"},
            {"木金金", "凶", "★個性頑強，與人不和。容易孤獨、遭難。家庭易生離散。"},
            {"木金水", "凶", "★經常不安。容易有急變之事，有腦溢血或其它之病難。"},
            {"木水木", "吉", "★喜歡幫助他人，能成功。"},
            {"木水火", "凶", "★能成功，但恐不能持久。易生急變及病患，有心臟或腦部之病災。"},
            {"木水土", "凶", "★一旦成功，即會崩潰。有災難、突變與病難之可能性。"},
            {"木水金", "凶", "★可得成功。但，容易有腦部的病疾。"},
            {"木水水	中	吉	★有成功的機會。但，容易有破亂及病難。假如數理多帶吉數者，則可長壽、富豪。	"},
            {"火木木", "吉", "★勤儉。有生機，境遇安泰，能得長壽享福。"},
            {"火木火", "吉", "★基礎穩固，順利發展。身心健康，能得長壽。喜歡幫助他人；但，容易受人利用。"},
            {"火木土", "吉", "★有進取心則成功富貴。基礎穩固，身心健全，能得長壽。"},
            {"火木金", "凶", "★一成功，即多變。耐力不足。易見身心過於勞累，有腦部及胸部之病疾。"},
            {"火木水", "凶", "★為人機智。此格者，家庭易生雜亂，有急變的災難。"},
            {"火火木", "吉", "★一帆風順。基礎穩固，身心健全，長壽享福。但，須節制色慾。"},
            {"火火火	中	吉	★雖然有進展的機會，但因基礎不穩且缺乏耐力，所以易成易敗。要注意心臟及血管方面的健康。	"},
            {"火火土	中	吉	★可成功。但因缺乏耐力，易生分離作用。假若能忍柔當事，則可保持吉祥。	"},
            {"火火金", "凶", "★身心過勞。故，容易罹患腦部及呼吸系統的病疾。"},
            {"火火水", "凶", "★易生意外的凶厄。有腦溢血或心臟麻痺之病災。"},
            {"火土木", "凶", "★依靠祖上餘德或長輩的提拔，而得成功發展。然而，個人之基礎多見不穩固。容易有腹部、胃腸方面之病疾。"},
            {"火土火", "吉", "★能得長輩提拔，而發展成功。身心健康，長壽享福。"},
            {"火土土", "吉", "★受長輩栽培而向上發展。境遇安泰，身心健全，長壽享福。"},
            {"火土金", "吉", "★可發展成功。不過，有消極的傾向。容易身心過勞；但，總能安穩的生活。"},
            {"火土水", "凶", "★可成功於一時。但是，有急變或病難而致死的情形。"},
            {"火金木", "凶", "★遭受壓抑，難以成功。此格者，須特別注意呼吸系統之病災，恐發狂致死。"},
            {"火金火", "凶", "★基礎不穩。容易罹患腦部與肺部的病疾，有急變的凶厄。"},
            {"火金土", "凶", "★多見煩惱，身心過勞。容易產生腦部及肺部的病疾。"},
            {"火金金", "凶", "★容易陷於孤獨的情形。容易有腦部與肺部的病疾。"},
            {"火金水", "凶", "★成功運不能伸張。容易罹患腦溢血或心臟麻痺的病疾。並，防急難情形。"},
            {"火水木", "凶", "★易生困難。有急變不測之禍。"},
            {"火水火", "凶", "★易生急變、災禍、死亡。多災多難，有自殺之慮。"},
            {"火水土", "凶", "★無法伸張，常見苦悶與煩惱。病弱而短壽。"},
            {"火水金", "凶", "★難以發展。容易有病痛，多災多難。"},
            {"火水水", "凶", "★難以成功。多困苦，多災多難。"},
            {"土木木", "凶", "★多有苦悶與煩惱。晚年稍可平安。"},
            {"土木火	中	吉	★身心多苦悶。只有數理很好的情況下，才能平安。	"},
            {"土木土", "凶", "★常感苦悶。有神經衰弱或其它病難。"},
            {"土木金", "凶", "★日常不安。有神經衰弱及呼吸器官的病疾。"},
            {"土木水", "凶", "★流轉離難，多病難。有急變的災厄而損失生命與財產。"},
            {"土火木	中	吉	★數理吉，則身心平安能得長壽幸福。若數理凶，則有腦病之慮。	"},
            {"土火火", "吉", "★若能柔忍當事，可得成功；且，足以揚名。"},
            {"土火土", "吉", "★飛黃騰達。基礎穩固而安泰，身心健全，長壽享福。"},
            {"土火金", "凶", "★身心勞病。基礎不穩，家庭不幸。"},
            {"土火水", "凶", "★基礎不穩。易生急變，易生災厄。"},
            {"土土木", "凶", "★基礎不穩，易生變動。容易罹患腹部、胃腸、神經衰弱等病疾。"},
            {"土土火", "吉", "★名利雙收。基礎穩固，長壽享福。"},
            {"土土土	中	吉	★可以成功、平安。但，假如數理多帶凶數者，則有不足與災難；婦女則不貞。	"},
            {"土土金", "吉", "★成功發展。身心健全，長壽享福。"},
            {"土土水", "凶", "★基礎不穩。容易崩潰與失敗。有急禍而致失財。"},
            {"土金木", "凶", "★基礎不穩。有腦病與意外的災難。男命則剋妻與子。"},
            {"土金火", "凶", "★境遇不安。易生腦病與肺病。家庭不睦。"},
            {"土金土", "吉", "★成功發展，境遇安泰。身心健和，能得長壽享福。"},
            {"土金金", "吉", "★名利雙收。但，性情剛強而與人不睦。假如能和氣待人，則可成功。"},
            {"土金水	中	吉	★數理吉，可得平安。數理凶，則多悲運。	"},
            {"土水木", "凶", "★徒勞無功。多病弱，有短命之慮。"},
            {"土水火", "凶", "★多破亂，有失財或失命之慮。男命剋妻子。"},
            {"土水土", "凶", "★境遇不安，徒勞無功。容易有腦溢血或心臟麻痺的病疾。"},
            {"土水金", "凶", "★心理有不滿現狀的激動情緒，使得心神不安，容易興風作浪。一生多見病災。"},
            {"土水水", "凶", "★難伸展。多病難，家庭不和。"},
            {"金木木", "凶", "★難得成功。容易罹患神經衰弱或半身不遂。"},
            {"金木火", "凶", "★多見中途而廢，難受提拔。容易罹患腦病握神經衰弱的病疾。"},
            {"金木土", "凶", "★無法與人和睦相處。身心過勞而容易罹患神經衰弱的病疾。"},
            {"金木金", "凶", "★上下夾攻的形勢，造成孤立無援的情形。多受迫害，坐立不安。有腦部及胸部的災禍。"},
            {"金木水", "凶", "★早年失敗，晚年則漸入佳境。本身無多大發展；但，子孫則可使家業中興。"},
            {"金火木", "凶", "★難得發展，一籌莫展。容易罹患腦部及肺部的病痛。"},
            {"金火火", "凶", "★心理不滿現狀。中年有變化。容易罹患腦部及肺部的病痛。"},
            {"金火土", "凶", "★不滿現狀而陷入苦悶之中。有腦病。"},
            {"金火金", "凶", "★身心過勞，妻離子散。易罹患肺病。"},
            {"金火水", "凶", "★上下不和，難以成長，終形成孤立無援的窘境。容易罹患腦溢血或心臟麻痺的病疾。"},
            {"金土木", "凶", "★基礎不穩，易生變動。有胃腸及肝臟方面的病疾。"},
            {"金土火", "吉", "★順利發展，名利雙收。"},
            {"金土土", "吉", "★順利進展而成功，名利雙收。身心健全，長壽享福。"},
            {"金土金", "吉", "★喜歡幫助他人，可順利成功。若能節制色慾，則能健壯而福壽雙全。"},
            {"金土水", "凶", "★基礎不穩，難得成功。容易罹患腎臟病疾。女命則多見子宮炎"},
            {"金金木", "凶", "★性情過剛，不易與人和睦相處，以致常與人爭是論非。健康方面則有車禍之厄，並防半身不遂之大災難。"},
            {"金金火", "凶", "★身心過勞。容易有腦溢血或肺疾。多災厄。"},
            {"金金土", "吉", "★身心健全。能和氣待人，則可成功。"},
            {"金金金", "凶", "★性情過剛，不易與人和睦相處，致常與人有口舌之爭，造成人際關係的不佳。家庭多雜亂。"},
            {"金金水", "凶", "★性情頑固，與人不和，而造成事業不順。有急變的災厄。"},
            {"金水木", "凶", "★雖能成功；家庭多不幸。多病厄。"},
            {"金水火", "凶", "★雖能成功；但，基礎不穩，有急變之災厄。"},
            {"金水土", "凶", "★性情憂悶，難以成功。有急變災厄。"},
            {"金水金", "吉", "★假如數理多帶吉數者，可被愛戴而引荐成功。假如數理多帶凶數者，有急變的災厄。"},
            {"金水水", "凶", "★若得提拔，也能成功。但是，大部份是流落異鄉，且有急變的災厄。"},
            {"水木木", "吉", "★能得長輩引進而順利發展，基礎安穩，身心健全，繁榮昌盛。長壽享福，家業隆昌。"},
            {"水木火", "凶", "★有成功運和發達運。但，天格與地格的水火相剋，所以家庭常有不祥的事情發生，有不幸和招致災禍的可能。"},
            {"水木土", "吉", "★能得長輩的提拔，順利成功發展。基礎運如立磐石之上；若更能堅忍，則可順利安泰。"},
            {"水木金", "凶", "★可以得到發展，成功運尚佳。防境遇不穩，生有變動，致迫害臨身。身心過勞，容易罹患肝病或防外傷。"},
            {"水木水", "凶", "★順利發展的成功運，防性情飄忽不定，行動輕浮乃致失敗。困苦勞心，有變動、病難之慮。"},
            {"水火木", "凶", "★成運運易見受外在環境壓抑而受挫。防突發性之災禍、困難，容易罹患腦溢血或心臟麻痺的病疾。"},
            {"水火火", "凶", "★遭受壓抑，不能有所伸展，難以成功。有急變的災禍或其他的不祥事。"},
            {"水火土", "凶", "★財來財去，力不從心。家庭分離，不和睦。容易發生急變之事而短命。"},
            {"水火金", "凶", "★與人難相處，身心易見過勞。多災厄。"},
            {"水火水", "凶", "★孤力無援。多災厄。容易罹患腦溢血或心臟麻痺的病疾。"},
            {"水土木", "凶", "★做事多受阻礙，難以成功。容易罹患胃腸或肺部的病疾。"},
            {"水土火", "凶", "★基礎運健全，可保平安。但是，家庭中常有明爭暗鬥的事情發生。"},
            {"水土土", "吉", "★穩重，能得平安。"},
            {"水土金	中	吉	★年輕時較消極。中年而後，漸得進展，安定吉祥。	"},
            {"水土水", "凶", "★做事多阻礙。性情頑固。有急變的災厄，容易罹患胃病或腎臟方面的病疾。"},
            {"水金木", "凶", "★基礎不穩，常有變動。有外傷之慮。"},
            {"水金火", "凶", "★基礎不穩。容易過勞，而致肺病。有急變或急死之慮。"},
            {"水金土", "吉", "★順調進展，達成目的。基礎平穩，身心健全。長壽，享福。"},
            {"水金金", "吉", "★可向上發展，得到成功。有勇氣。"},
            {"水金水", "凶", "★喜歡幫助他人，而自己受累。容易被色情所牽累。"},
            {"水水木", "凶", "★性情放蕩。容易產生急變的災厄。"},
            {"水水火", "凶", "★飄浮不定乃致失敗。有急變的災厄。"},
            {"水水土", "凶", "★時常變化，境遇不穩。有急變災厄。"},
            {"水水金", "凶", "★自我心過強。好動而不知自我控制，終致失敗，病弱，流離。"},
            {"水水水", "凶", "★病弱而短壽。流離失所，行為不檢。"},};
    private LuozhuangNameClass myName;

    public LuozhuangNameClass getNameClass() {
        return myName;

    }

    public JavaLuozhuangtestnameClass(String name) throws IllegalArgumentException {
        myName = new LuozhuangNameClass(name);
        int[] nameint = myName.getNameliborder();
        for (int i = 0; i < nameint.length; i++) {
            if (nameint[i] == -1) {
                myName = null;
                throw new IllegalArgumentException("没有收录该汉字");
            }

        }

    }

    public String[] getwuxji() {

        //天地人三才格
        String TDR = myName.getNameWX(myName.getNamesky()) + myName.getNameWX(myName.getNameearth()) + myName.getNameWX(myName.getNamepeople());
        for (int i = 0; i < arrayTDRG.length; i++) {
            String panbitemp = arrayTDRG[i][0];
            if (panbitemp.equals(TDR)) {
                return arrayTDRG[i];
            }
        }
        return null;

    }

    public String[] gettotalnameji(int number) {
        if (number > arraytotal.length || number < 1) {
            return null;

        }
        return arraytotal[number - 1];
    }

    public void testname() throws IllegalArgumentException {
        Luozhuangnamewuxing myLuozhuangnamewuxing = new Luozhuangnamewuxing();
        int[] temp = myLuozhuangnamewuxing.getnameliborder(myName.getName());
        int[] wuxing = myLuozhuangnamewuxing.getnameWX(temp);
        int[] BH = myLuozhuangnamewuxing.getnameBH(temp);
        System.out.println(myName.getName() + "的五行");
        myLuozhuangnamewuxing.pringst(myLuozhuangnamewuxing.getnameWXarray(wuxing));
        System.out.println(myName.getName() + "的笔画");
        myLuozhuangnamewuxing.pringst(BH);


        System.out.println(myName.getName() + "的天格");
        System.out.println(getMyName().getNamesky());
        System.out.println(myName.getNameWX(getMyName().getNamesky()));

        System.out.println(myName.getName() + "的地格");
        System.out.println(getMyName().getNameearth());

        System.out.println(myName.getNameWX(getMyName().getNameearth()));
        System.out.println(myName.getName() + "的人格");
        System.out.println(getMyName().getNamepeople());

        System.out.println(myName.getNameWX(getMyName().getNamepeople()));
        System.out.println(myName.getName() + "的外格");
        System.out.println(getMyName().getNameout());
        System.out.println(myName.getNameWX(getMyName().getNameout()));

        System.out.print("此人总笔画");
        System.out.println((myName.getTotal()));

        System.out.println("说明：字的笔划以《康熙字典》为准，康熙笔划计算方法与简体笔划有所区别，不能以现在计算笔划的方法去计算。为保证本站提供的测算内容精准，编辑人员花费了大量时间和精力与《康熙字典》原版进行核对。如果您发现错误，敬请及时与我们联系，谢谢！");

        System.out.println("天格的解析：天格数是先祖留传下来的，其数理对人影响不大。 什么是天格？\n"
                + "什么是天格：天格是由您的姓决定的，姓是祖辈流传下来的。它的数理对人生并无直接的影响。所以，天格的吉凶数理不用重视。在测名字的时候，也会有天格的数理吉凶解释，那是对这个数字的解释，本身无太大意义。  ");
        myLuozhuangnamewuxing.pringst(gettotalnameji(myName.getNamesky()));


        System.out.println("人格的解析：人格数又称主运，是姓名的中心点，影响人一生的命运。 什么是人格？\n"
                + "什么是人格：人格非常重要，是这个名字的中心、精髓！人格的吉凶，对人的影响很大，就如四柱当中的日柱一样，是判断名字好坏吉凶的一个标准。  ");
        myLuozhuangnamewuxing.pringst(gettotalnameji(myName.getNamepeople()));


        System.out.println("地格的解析：地格数又称前运，影响人中年（36岁）以前的活动力。 什么是地格？\n"
                + "什么是地格：地格和人格有密切的关系，主要影响人年轻时的命运，地格也比较重要。其数理吉凶，也代表与子女、部属、晚辈的关系。  ");
        myLuozhuangnamewuxing.pringst(gettotalnameji(myName.getNameearth()));


        System.out.println("外格的解析：外格又称变格，影响人的社交能力、智慧等。 什么是外格？\n"
                + "什么是外格：外格通常指和社会上的关系的融洽程度，在实际预测中其准确度较低，对人生的作用不是很大，在专业预测当中也很少去用。外格的数理不用重视。  ");
        myLuozhuangnamewuxing.pringst(gettotalnameji(myName.getNameout()));


        System.out.println("总格的解析：总格又称后运，影响人中年（36岁）以后的命运。 什么是总格？\n"
                + "什么是总格：判断名字的吉凶，一般先看总格，再看人格。总格对人的晚运和一生运势均有影响。总格就如植物的根，根好则枝繁叶茂。因此，名字吉凶一定要看总格。  ");
        myLuozhuangnamewuxing.pringst(gettotalnameji(myName.getTotal()));
        System.out.print("此人天地人三才格参考");
        myLuozhuangnamewuxing.pringst(getwuxji());

    }

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {

        JavaLuozhuangtestnameClass myJavaLuozhuangtestname = new JavaLuozhuangtestnameClass("罗庄");
        myJavaLuozhuangtestname.testname();
    }

    /**
     * @return the myName
     */
    public LuozhuangNameClass getMyName() {
        return myName;
    }
}