package Web3jNetty.datebirth.utilClass;
/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

import Web3jNetty.datebirth.util.LuozhuangNameClass;

/**
 * 人生因爱情而改变，他是你最爱的人吗？
 * 你们相爱会有好的结局吗？
 * 发送姓名(男)配姓名(女)，
 * 如郭靖配黄蓉，联通用户发送到XXX，移动用户发送到XXX，就可以知道你们爱情的结局，千万不要错过哦。
 * <p>
 * 姓名缘分测试
 *
 * @author luozhuang 大师♂罗莊
 */
public class LuozhuangNametogetherTestClass {

    String[][] arrayaddresutlt = {
            {"11", "你们的姓名笔画总数表示", "他对你献真情"},
            {"12", "你们的姓名笔画总数表示", "他已有心上人"},
            {"13", "你们的姓名笔画总数表示", "此情不渝"},
            {"14", "你们的姓名笔画总数表示", "他时常暗中注意你　"},
            {"15", "你们的姓名笔画总数表示", "他有企图要小心　"},
            {"16", "你们的姓名笔画总数表示", "两人有默契　"},
            {"17", "你们的姓名笔画总数表示", "他非常关心你　"},
            {"18", "你们的姓名笔画总数表示", "你和他只能做朋友"},
            {"19", "你们的姓名笔画总数表示", "兴趣不合", ""},
            {"20", "你们的姓名笔画总数表示", "他会爱你　"},
            {"21", "你们的姓名笔画总数表示", "他非常在乎你　"},
            {"22", "你们的姓名笔画总数表示", "女方主动　"},
            {"23", "你们的姓名笔画总数表示", "要长期交往　"},
            {"24", "你们的姓名笔画总数表示", "也有人暗中注意你"},
            {"25", "你们的姓名笔画总数表示", "女方单恋　"},
            {"26", "你们的姓名笔画总数表示", "不能长相厮守　"},
            {"27", "你们的姓名笔画总数表示", "他会喜欢你"},
            {"28", "你们的姓名笔画总数表示", "要长期交往"},
            {"29", "你们的姓名笔画总数表示", "他早就爱上你"},
            {"30", "你们的姓名笔画总数表示", "他会抛弃你"},
            {"31", "你们的姓名笔画总数表示", "要互相沟通"},
            {"32", "你们的姓名笔画总数表示", "兴趣不合"},
            {"33", "你们的姓名笔画总数表示", "他非常讨厌你　"},
            {"34", "你们的姓名笔画总数表示", "两情相悦"},
            {"35", "你们的姓名笔画总数表示", "男生主动　"},
            {"36", "你们的姓名笔画总数表示", "此情不渝　"},
            {"37", "你们的姓名笔画总数表示", "他有企图要小心　"},
            {"38", "你们的姓名笔画总数表示", "他非常在乎你", ""},
            {"39", "你们的姓名笔画总数表示", "他会爱你　"},
            {"40", "你们的姓名笔画总数表示", "女方单恋　"},
            {"41", "你们的姓名笔画总数表示", "第三者介入"},
            {"42", "你们的姓名笔画总数表示", "他已有心上人　"},
            {"43", "你们的姓名笔画总数表示", "早点分手比较好　"},
            {"44", "你们的姓名笔画总数表示", "不能长相厮守"},
            {"45", "你们的姓名笔画总数表示", "两情相悦　"},
            {"46", "你们的姓名笔画总数表示", "他对你献真情"},
            {"47", "你们的姓名笔画总数表示", "他有一堆女朋友　"},
            {"48", "你们的姓名笔画总数表示", "他时常暗中注意你　"},
            {"49", "你们的姓名笔画总数表示", "此情不渝　"},
            {"50", "你们的姓名笔画总数表示", "他会喜欢你"},
            {"51", "你们的姓名笔画总数表示", "要长期交往　"},
            {"52", "你们的姓名笔画总数表示", "他早就爱上你"},
            {"53", "你们的姓名笔画总数表示", "他会抛弃你　"},
            {"54", "你们的姓名笔画总数表示", "要互相沟通"},
            {"55", "你们的姓名笔画总数表示", "他已有心上人"},
            {"56", "你们的姓名笔画总数表示", "两人有默契　"},
            {"57", "你们的姓名笔画总数表示", "他非常关心你"},
            {"58", "你们的姓名笔画总数表示", "兴趣不合　"},
            {"59", "你们的姓名笔画总数表示", "第三者介入　"},
            {"60", "你们的姓名笔画总数表示", "早点分手比较好"},
            {"61", "你们的姓名笔画总数表示", "两人有默契　"},
            {"62", "你们的姓名笔画总数表示", "你和他只能做朋友　"},
            {"63", "你们的姓名笔画总数表示", "男生主动"},
            {"64", "你们的姓名笔画总数表示", "他非常讨厌你　"},
            {"65", "你们的姓名笔画总数表示", "两情相悦　"},
            {"66", "你们的姓名笔画总数表示", "他有一堆女朋友　"},
            {"67", "你们的姓名笔画总数表示", "他会爱你　"},
            {"68", "你们的姓名笔画总数表示", "要长期交往"},
            {"69", "你们的姓名笔画总数表示", "此情不渝"},
            {"70", "你们的姓名笔画总数表示", "他有一堆女朋友"},
            {"71", "你们的姓名笔画总数表示", "他时常暗中注意你　"},
            {"72", "你们的姓名笔画总数表示", "他有企图要小心　"},
            {"73", "你们的姓名笔画总数表示", "他对你献真情　"},
            {"74", "你们的姓名笔画总数表示", "他已有心上人　"},
            {"75", "你们的姓名笔画总数表示", "他非常在乎你　"},
            {"76", "你们的姓名笔画总数表示", "女方主动　"},
            {"77", "你们的姓名笔画总数表示", "也有人暗中注意你　"},
            {"78", "你们的姓名笔画总数表示", "女方单恋　"},
            {"79", "你们的姓名笔画总数表示", "要长期交往", ""},
            {"80", "你们的姓名笔画总数表示", "不能长相厮守"},
            {"81", "你们的姓名笔画总数表示", "他会喜欢你　"},
            {"82", "你们的姓名笔画总数表示", "他早就爱上你　"},
            {"83", "你们的姓名笔画总数表示", "他会抛弃你", ""},
            {"84", "你们的姓名笔画总数表示", "要互相沟通"},
            {"85", "你们的姓名笔画总数表示", "两人有默契　"},
            {"86", "你们的姓名笔画总数表示", "他非常关心你　"},
            {"87", "你们的姓名笔画总数表示", "你和他只能做朋友"},
            {"88", "你们的姓名笔画总数表示", "兴趣不合　"},
            {"89", "你们的姓名笔画总数表示", "男生主动　"},
            {"90", "你们的姓名笔画总数表示", "第三者介入"}};
    String[][] arraysubtractresutlt = {
            {"0", "天生一对，佳偶天成", "你们是如此的匹配，如此和谐，往往是你刚想说“可惜”他已经开始叹惜。你们性格相合，有共同的爱好，品味一致。就是这么默契，令人们羡慕得不得了。没办法，谁叫你们连姓名的笔画也一样呢。"},
            {"1", "一见钟情，两情相悦", "你们在看到对方的第一眼就深深地被吸引，并立刻爱上对方，接着就是干柴烈火般的热。海誓山盟的爱情宣言是你们奉行的金科玉律。她崇拜他，同样她也令他着迷，他们就像磁石与铁一样相互吸引。"},
            {"2", "执子之手，与子携老", "你们是众人眼中的神仙眷侣，站在一起怎么看怎么般配，很有传说中的夫妻相。你们之间或许没有惊天地泣鬼神的爱情神话，或许没有刻骨铭心的激情，但是你的之间的温情和默契却能让你们的心越走越近，一起慢慢变老。"},
            {"3", "欢喜冤家，分分合合", "你们前世是冤家，今生做情侣，所以就难免有一些不和谐的音符出现来折磨你们的爱情。你们的感情大起大落，分分合合，不过你们最终会修成正果，恩爱到老的。"},
            {"4", "有缘无分，两两相忘", "你们的感情一般是从学生时代开始的，那青涩的恋爱留给你们酸酸甜甜的味道让你们用一生去怀念彼此，但是你们的爱情却注定了没有结果，你们会试着遗忘对方，开始自己新的生活，但心中那最温柔的角落一直被初恋占据。"},
            {"5", "风雨之后，亮丽彩虹", "你们都是性情中人，你们都受过感情的伤，你们都一样脆弱而敏感同。同样的经历，同样的伤痛，让你更容易靠近。你们的感情在相互疗伤中一点一点加深，你们的心痊愈了，你们的爱情也圆满了。"},
            {"6", "日久生情，顺理成章", "你们很可能是在一起工作的同事，你们发展的是办公室爱情。朝九晚五的生活使你们互相产生好感，上下班路上的闲谈增进你们相互了解。你们的手牵在一起是顺理成章的事，", "在办公室里偷看一眼心上人也是你们最大的乐趣。"},
            {"7", "知心朋友，心灵相通", "你们可以无话不谈，你们可以心有灵犀，但是你们却很难成为情侣。因为你们太熟悉彼此，太了解对方了，所以很难擦出火花。其实你们不用遗憾，人生得一知己足矣，就这样一直做朋友也很不错。"},
            {"8", "青梅竹马，两小无猜", "你们的父母就很好的朋友，你们从穿开裆裤时就在一起。一起进幼儿园，一起上小学，一起过家家，一起闯祸后对家长撒谎。你们是长辈默认的娃娃亲，你们是邻居眼中的金童玉女，走到一起是天经地义的事。"},
            {"9", "你喜欢他（她），他（她）爱别人", "在爱情的舞会上，你来晚了一步，你的心上人已经有了自己的NO.1，两人亲密无间，你已无缝插针。因此注定了你这段感情要深埋在心里，注定你是暗恋了小倒霉蛋。所以赶快清理一下心绪，去属于自己的爱情里做主角吧。"},
            {"10", "浓情蜜意，情手难牵", "你们真的很合适，总能从对方的一个眼神洞悉心上人心中的一切。但是你们却走不到一起，并不是你们的原因，而是其他的因素，所以你们这段无疾而终的恋情令所有知情者扼腕。"},
            {"11", "牛郎织女，聚少离多", "你们的爱情基础非常深厚，牢不可破，然而却因为求学或工作的原因，使得你们分隔两地，聚少离多。也许是因为相聚短暂而益显珍贵，而e信来往，电话传情给你们平添一份情调。"},
            {"12", "相约黄昏，共赏夕阳", "你们或许因为年少轻狂，或许月老作弄，你们错过了年轻时激扬的热情。当你们的缘分到来的时候，你们已经经历了大半辈子的沧桑。好不容易结合的你们会更加珍惜、享受这迟来的爱。"},
            {"13", "同床异梦，貌合神离", "在外人的眼中你们或许是一对模范夫妻，只有你自己心里明白根本不是那么一回事。你们根本就不了解对方，也不想去了解，各自有各自的圈子，交集很少。长痛不如短痛，还是选择放手吧。"},
            {"14", "缘分天定，破镜重圆", "你们真是一对打不散的鸳鸯，情投意合，相互吸引。但是或话由于你们都太花心，都想有更多的选择，所以你们的罗曼史都很丰富。但是经历过后都会回头看到彼此，做出最正确的选择。"},
            {"15", "水深火热，水火相容", "谁水火不相容的，你们就相处得不错。你们一个似水，平和，内殓。一个如火，热情，洒脱。两个性情迥异的人一样可以找到共同点，一样可以谱写爱曲。"},
            {"16", "一本好书，只看一半", "你们都是很有内秀的人，也都能看穿人的内心。你们的感情甜美却不持久，当对方不能吸引你时，你会决然地放手。他（她）就像一本小说，你打开了，却没能读完。"},
            {"17", "丑小鸭，白天鹅", "你们的差距很大，你们的结合完全打破了门当户对的传说。但是不管别人怎么看，你们就是这么恩爱。白天鹅怎么会爱上丑小鸭，只有他们自己清楚。"},
            {"18", "单恋一枝花", "你的爱情也是从暗恋开始的，不过你会让他（她）上你。或许很曲折，会受伤，但你一直执着。朋友劝你天涯处处有芳草，你却单恋一枝花。"},
            {"19", "悠悠岁月，爱情长跑", "你们爱情的战线拉得很长，或许三五年，或许十几年。但是结果是令人满意的，爱与被爱的人最后都会死心塌地。"},
            {"20", "顺其自然，水到渠成", "如果问你们是谁先追的谁，是谁主动，你们回答不出来，因为你们的爱情在不知不觉中就来了，你们只不过是顺其自然地携起手。"},
            {"22", "爱是永恒，平淡是真", "你们可能是经人介绍的，你们可能没有经过热就结婚。但是你们感情却很真实，与其你们的爱情平淡，不如说你们是大爱无声"},
            {"22", "一眼万年，相思连连　", "你们可能是被现实分开的情侣，你们可能是在有归宿后相见。你们相爱，却不能在一起，只能遥远地思念。"}
    };

    public void test(String man, String woman) {

        System.out.println("你们名字：");
        System.out.println(man);
        System.out.println(woman);
        LuozhuangNameClass manNameClass = new LuozhuangNameClass(man);
        LuozhuangNameClass womanNameClass = new LuozhuangNameClass(woman);

        int mantotal = manNameClass.getTotal();
        int womantotal = womanNameClass.getTotal();
        int addreuslt = mantotal + womantotal;
        addreuslt = addreuslt - 11;//数组从11画开始
        int subtractresutlt = Math.abs(mantotal - womantotal);
        System.out.println("你们名字笔画之和结果：");
        if (addreuslt < 0 || addreuslt > arrayaddresutlt.length) {
            System.out.println("你们名字太强悍，无力吐槽");

        } else {
            pringst(arrayaddresutlt[addreuslt]);
        }
        System.out.println("你们名字笔画相减结果：");
        if (subtractresutlt < 0 || subtractresutlt > arraysubtractresutlt.length) {
            System.out.println("你们名字太强悍，无力吐槽");

        } else {
            pringst(arraysubtractresutlt[subtractresutlt]);
        }
    }

    public String pringst(String[] res) {
        StringBuffer result = new StringBuffer();
        for (int i = 0; i < res.length; i++) {


            result.append(res[i]);
            result.append("   ");
        }

        result.append("\n");
        System.out.println(result);
        return result.toString();
    }

    public static void main(String[] args) {
        System.out.println("人生因爱情而改变，他是你最爱的人吗？你们相爱会有好的结局吗？发送姓名(男)配姓名(女)，如郭靖配黄蓉，联通用户发送到XXX，移动用户发送到XXX，就可以知道你们爱情的结局，千万不要错过哦。");
        LuozhuangNametogetherTestClass my = new LuozhuangNametogetherTestClass();
        my.test("罗庄", "真白");
    }
}